
ALLOWED_EXTS = {".png",".jpg",".jpeg",".tif",".tiff",".pdf"}
LANG_LIST = ["ru","en"]
DEFAULTS = {
    "scale": 1.5,
    "denoise_h": 15,
    "sharp_amount": 2.0,
    "ocr_threshold": 0.85,
    "pdf_dpi": 300
}
MAX_FILE_SIZE_MB = 60
PREVIEW_MAX_WIDTH = 700
CITIES_HINT = [
    "Алматы","Астана","Шымкент","Караганда","Костанай","Павлодар","Усть-Каменогорск","Тараз","Актобе","Атырау","Кокшетау","Семей",
    "Минск","Гомель","Гродно","Могилев","Витебск","Брест","Жлобин","Орша","Барановичи",
    "Москва","Санкт-Петербург","Екатеринбург","Новосибирск","Казань","Челябинск","Самара","Нижний Новгород"
]
